## 1. 파일로 실행하는 SQL

### 1.1. students.sql 코드 이해하기

#### 데이터베이스 생성

DROP DATABASE IF EXISTS student_mgmt;
CREATE DATABASE student_mgmt DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

* DEFAULT CHARSET=utf8 COLLATE=utf8_bin
  - 문자 인코딩(문자셋)과 관련된 설정 
    - 한글 데이터의 정확한 처리를 위해, 데이터베이스/테이블 생성시에 추가
    - 문자셋(Character set)은 각 문자가 컴퓨터에 저장될 때 어떠한 '코드'로 저장될지에 대한 규칙의 집합을 의미
  - 콜레이션(Collation)은 특정 문자 셋에 의해 데이터베이스에 저장된 값들을 비교 검색하거나 정렬 등의 작업을 위해 문자들을 서로 '비교' 할때 사용하는 규칙들의 집합을 의미

#### 테이블 생성

In [ ]:
USE student_mgmt;
DROP TABLE IF EXISTS students;
CREATE TABLE students (
  id TINYINT NOT NULL AUTO_INCREMENT,
  name VARCHAR(10) NOT NULL,
  gender ENUM('man','woman') NOT NULL,
  birth DATE NOT NULL,
  english TINYINT NOT NULL,
  math TINYINT NOT NULL,
  korean TINYINT NOT NULL,
  PRIMARY KEY (id)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

- ENUM 타입: 특정 값만 저장할 수 있도록 저장 가능 값을 지정해주는 데이터 타입
- ENGINE=InnoDB : 스토리지 엔진이 여러 가지 있습니다. 이 중에서 InnoDB로 스토리지 엔진을 정해주는 명령입니다. 이 명령을 안해줘도 최근 Mysql 버전은 디폴트로 엔진을 InnoDB를 쓴다고 합니다.
- 테이블을 만들때도 DEFAULT CHARSET=utf8 인코딩을 해주세요

#### 데이터 입력

In [ ]:
INSERT INTO students (name, gender, birth, english, math, korean) VALUES ('dave', 'man', '1983-07-16', 90, 80, 71);
INSERT INTO students (name, gender, birth, english, math, korean) VALUES ('minsun', 'woman', '1982-10-16', 30, 88, 60);
INSERT INTO students (name, gender, birth, english, math, korean) VALUES ('david', 'man', '1982-12-10', 78, 77, 30);
INSERT INTO students (name, gender, birth, english, math, korean) VALUES ('jade', 'man', '1979-11-1', 45, 66, 20);
INSERT INTO students (name, gender, birth, english, math, korean) VALUES ('jane', 'man', '1990-11-12', 65, 32, 90);
INSERT INTO students (name, gender, birth, english, math, korean) VALUES ('wage', 'woman', '1982-1-13', 76, 30, 80);
INSERT INTO students (name, gender, birth, english, math, korean) VALUES ('tina', 'woman', '1982-12-3', 87, 62, 71);

### 1.2. students.sql 파일로 SQL 실행하기
* Mysql Workbench
  - File -> Open SQL Script -> students.sql

* Mysql 터미널 명령 
  - SOURCE students.sql
  - studnets.sql 파일 위치는 터미널 명령을 실행하는 동일 디렉토리에 있거나, 해당 디렉토리까지 명시해줘야 함

### 1.3. 테이블에 데이터 한번에 입력하기

* mysql CLI로 CSV 파일 LOAD 하기 (현업에서는 mysql CLI로 많이 사용합니다.)

mysql> LOAD DATA INFILE 'CSV 데이터 파일' INTO TABLE student_mgmt.students (name, gender, birth, english, math, korean);

* Mysql Workbench
  - Go to Schemas -> Find student_mgmt database (만약 없으면, Schemas 메뉴의 refresh 버튼) -> Go to Tables -> Go to students -> Table Data Import Wizard -> student.csv File 선택 -> Source Column / Dest Column 설정 -> Import

## 2. pandas 라이브러리와 pymysql

### 2.1 read_sql()
* pandas 라이브러리의 현란한 기능 중, read_sql() 메서드로 SQL 바로바로 확인하기

#### 데이터베이스 접속

In [1]:
import pymysql
import pandas as pd

In [10]:
host_name = 'localhost'
host_port = 3306
username = 'root'
password = '?????'    # git에 push하지 말 것
database_name = 'student_mgmt'

In [11]:
db = pymysql.connect(
    host=host_name,     # MySQL Server Address
    port=host_port,          # MySQL Server Port
    user=username,      # MySQL username
    passwd=password,    # password for MySQL username
    db=database_name,   # Database name
    charset='utf8'
)

#### pandas.read_sql(쿼리, 연결된 db connection 객체)

In [12]:
SQL = "SHOW TABLES"

In [13]:
df = pd.read_sql(SQL, db)

In [14]:
df

  Tables_in_student_mgmt
0               students

In [15]:
SQL = "SELECT * FROM students"
df = pd.read_sql(SQL, db)
df.to_csv('students.csv', sep=',', index=False, encoding='utf-8')
df

    id    name gender       birth  english  math  korean
0    1    dave    man  1983-07-16       90    80      71
1    2  minsun  woman  1982-10-16       30    88      60
2    3   david    man  1982-12-10       78    77      30
3    4    jade    man  1979-11-01       45    66      20
4    5    jane    man  1990-11-12       65    32      90
5    6    wage  woman  1982-01-13       76    30      80
6    7    tina  woman  1982-12-03       87    62      71
7    8    dave    man  1981-07-16       91    80      71
8    9    dave    man  1983-07-16       90    40      71
9   10    dave    man  1983-07-16       90    50      71
10  11    dave    man  1983-07-16       90    20      71
11  12    dave    man  1983-07-16       90    80      60
12  13    dave    man  1983-07-16       30    80      71
13  14    dave    man  1983-07-16       20    80      71
14  15    dave    man  1983-07-16       10    80      71
15  16    dave    man  1983-07-16       90    80      35
16  17    dave    man  1983-07-16       90    80      71

### 2.2 to_csv()
* pandas 라이브러리의 현란한 기능 중, to_csv() 메서드로 검색 결과 파일로 저장하기
  - csv 파일 포멧은 데이터간 콤마(,)로 구분해서 표시하는 단순 형식을 가지고 있음
  - csv 파일 포멧은 엑셀 프로그램에서도 읽고, 쓸 수 있으며, IT에서 많이 사용됨

In [26]:
df.to_csv('students.csv', sep=',', index=False encoding='utf-8')

## 3. 외래키 (FOREIGN KEY)

### 3.1. 데이터베이스 준비 (한글 설정도 다시 한번 코드로 상기하면서 데이터 넣기)

#### sqlDB 를 만들고, userTbl, buyTbl 두 테이블을 만듬
* buyTbl 테이블의 다음 SQL 구문이 핵심
  - FOREIGN KEY (userID) REFERENCES userTbl(userID)
  - buyTbl 테이블의 userID 커럼은 userTbl 테이블의 userID를 참조함!

#### 외래키(FOREIGN KEY)를 만드는 이유
* 두 테이블 사이에 관계를 선언해서, 데이터의 무결성을 보장 (무결성? 다음 실습을 통해 이해해보자!)

#### 실습 환경 구축
* userbuy.sql 을 Workbench 로 실행시키기

#### 실행환경이 구축되었으면 해당 데이터베이스로 접속해서 확인

In [16]:
import pymysql
import pandas as pd

In [17]:
host_name = 'localhost'
host_port = 3306
username = 'root'
password = '?????'    # git에 push하지 말 것
database_name = 'sqlDB'

In [18]:
db = pymysql.connect(
    host=host_name,     # MySQL Server Address
    port=host_port,          # MySQL Server Port
    user=username,      # MySQL username
    passwd=password,    # password for MySQL username
    db=database_name,   # Database name
    charset='utf8'
)

In [43]:
SQL = "select * from userTbl"
df = pd.read_sql(SQL, db)
df

  userID name  birthYear addr mobile1   mobile2  height       mDate
0    BBK  바비킴       1973   서울     010  00000000     176  2013-05-05
1    EJW  은지원       1972   경북     011  88888888     174  2014-03-03
2    JKW  조관우       1965   경기     016  99999999     172  2010-10-10
3    JYP  조용필       1950   경기     011  44444444     166  2009-04-04
4    KBS  김범수       1979   경남     011  22222222     173  2012-04-04
5    KKH  김경호       1971   전남     019  33333333     177  2007-07-07
6    LJB  임재범       1963   서울     016  66666666     182  2009-09-09
7    LSG  이승기       1987   서울     011  11111111     182  2008-08-08
8    SSK  성시경       1979   서울    None      None     186  2013-12-12
9    YJS  윤종신       1960   경남    None      None     170  2005-05-05

In [46]:
SQL = "select * from buyTbl"
df = pd.read_sql(SQL, db)
df

    num userID prodName groupName  price  amount
0     1    KBS      운동화        의류     30       2
1     2    KBS      노트북        전자   1000       1
2     3    JYP      모니터        전자    200       1
3     4    BBK      모니터        전자    200       5
4     5    KBS      청바지        의류     50       3
5     6    BBK      메모리        전자     80      10
6     7    SSK        책        서적     15       5
7     8    EJW        책        서적     15       2
8     9    EJW      청바지        의류     50       1
9    10    BBK      운동화        의류     30       2
10   11    EJW        책        서적     15       1
11   12    BBK      운동화        의류     30       2

#### buyTbl에 데이터를 추가해본다.

In [31]:
cursor = db.cursor()
SQL_QUERY = "INSERT INTO buyTbl (userID, prodName, groupName, price, amount) VALUES('STJ', '운동화', '의류', 30, 2);"
cursor.execute(SQL_QUERY)
db.commit()

#### 에러가 나면 정상임
* CONSTRAINT `buyTbl_ibfk_1` FOREIGN KEY (`userID`) REFERENCES `userTbl` (`userID`)
* userTbl 에 userID가 STJ인 데이터가 없기 때문에, 
  - FOREIGN KEY (userID) REFERENCES userTbl(userID)
  - buyTbl 테이블의 userID 커럼은 userTbl 테이블의 userID를 참조할 때, userTbl 테이블에 userID가 STJ인 데이터가 없으면, 입력이 안됨
  - 데이터 무결성 (두 테이블간 관계에 있어서, 데이터의 정확성을 보장하는 제약 조건을 넣는 것임)
  - 현업에서는 꼭 필요한 경우만 사용하는 경우가 많음 (비즈니스 로직이 다양하기 때문에, 제약을 걸어놓을 경우, 예외적인 비즈니스 로직 처리가 어렵기 때문)

#### 다음 데이터 넣어보기 (실습)

In [22]:
cursor = db.cursor()
SQL_QUERY = "INSERT INTO buyTbl (userID, prodName, groupName, price, amount) VALUES('BBK', '운동화', '의류', 30, 2);"
cursor.execute(SQL_QUERY)
db.commit()

#### 에러나면, 가능하면 한번 db connection 닫아주시고, 다시 connection 해주는 편이 좋을 수 있습니다.

In [24]:
db.close()

In [25]:
import pymysql
import pandas as pd

In [28]:
host_name = 'localhost'
host_port = 3306
username = 'root'
password = '?????'    # git에 push하지 말 것
database_name = 'sqlDB'

In [29]:
db = pymysql.connect(
    host=host_name,     # MySQL Server Address
    port=host_port,          # MySQL Server Port
    user=username,      # MySQL username
    passwd=password,    # password for MySQL username
    db=database_name,   # Database name
    charset='utf8'
)

#### 이번에는 userTbl 에 userID가 STJ 인 데이터를 넣어준 후에, 다시 buyTbl userID에 STJ 관련 데이터를 넣어줍니다.

In [30]:
cursor = db.cursor()
SQL_QUERY = "INSERT INTO userTbl VALUES('STJ', '서태지', 1975, '경기', '011', '00000000', 171, '2014-4-4');"
cursor.execute(SQL_QUERY)
db.commit()

In [32]:
SQL_QUERY = "INSERT INTO buyTbl (userID, prodName, groupName, price, amount) VALUES('STJ', '운동화', '의류', 30, 2);"
cursor.execute(SQL_QUERY)
db.commit()

#### 이번에는 userTbl에 userID가 STJ 관련 데이터를 삭제해봅니다.

- FORIGN KEY가 있는 테이블에서 먼저 삭제 해준 후 유저 테이블에서 삭제하면 된다. (참조 무결성)

In [41]:
buyTbl_DELETE_QUERY = "DELETE FROM buyTbl WHERE userID = 'STJ';"
cursor.execute(buyTbl_DELETE_QUERY)
db.commit()

In [42]:
SQL_QUERY = "DELETE FROM userTbl WHERE userID = 'STJ'"
cursor.execute(SQL_QUERY)
db.commit()

#### 에러나면 정상입니다.
* buyTbl 에 해당 userID를 참조하는 데이터가 있기 때문입니다.